#### Terraform Validation & Plan Results
* Terraform Version 📎`1.6.6`
* Working Directory 📂`./code/infra`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mazapi_resource.key_vault_secret_github_pat: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.KeyVault/vaults/gha-prd-kv001/secrets/github-pat][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mdata.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mazurerm_resource_group.resource_group_container_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mazurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/gha-prd-uai001][0m
[0m[1mazurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.Insights/components/gha-prd-appi001][0m
[0m[1mazurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.KeyVault/vaults/gha-prd-kv001][0m
[0m[1mdata.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-network/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-nsg001][0m
[0m[1mdata.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-network/providers/Microsoft.Network/routeTables/mycrp-prd-rt001][0m
[0m[1mdata.azurerm_log_analytics_workspace.log_analytics_workspace: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/DefaultResourceGroup-NEU/providers/Microsoft.OperationalInsights/workspaces/DefaultWorkspace-8f171ff9-2b5b-4f0f-aed5-7fa360a1d094-NEU][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-network/providers/Microsoft.Network/virtualNetworks/mycrp-prd-vnet001][0m
[0m[1mazapi_resource.subnet_private_endpoints: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-network/providers/Microsoft.Network/virtualNetworks/mycrp-prd-vnet001/subnets/CAPrivateEndpointSubnet][0m
[0m[1mazapi_resource.subnet_container_app: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-network/providers/Microsoft.Network/virtualNetworks/mycrp-prd-vnet001/subnets/ContainerAppSubnet][0m
[0m[1mazapi_resource.container_apps_environment: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.App/managedEnvironments/gha-prd-cae001][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.Insights/components/gha-prd-appi001|logAnalytics][0m
[0m[1mazurerm_role_assignment.uai_role_assignment_key_vault_secrets_user: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.KeyVault/vaults/gha-prd-kv001/providers/Microsoft.Authorization/roleAssignments/1708fae7-446b-0e42-c861-723487e1c631][0m
[0m[1mazurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.Network/privateEndpoints/gha-prd-kv001-pe][0m
[0m[1mazurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.KeyVault/vaults/gha-prd-kv001|logAnalytics][0m
[0m[1mazapi_resource.container_apps_job: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.App/jobs/gha-prd-caj001][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
  [31m-[0m destroy[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_application_insights[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_application_insights" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.Insights/components/gha-prd-appi001"
    }

[1m  # data.azurerm_monitor_diagnostic_categories.diagnostic_categories_key_vault[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "azurerm_monitor_diagnostic_categories" "diagnostic_categories_key_vault" {
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m log_category_groups = (known after apply)
      [32m+[0m[0m log_category_types  = (known after apply)
      [32m+[0m[0m logs                = (known after apply)
      [32m+[0m[0m metrics             = (known after apply)
      [32m+[0m[0m resource_id         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.KeyVault/vaults/gha-prd-kv001"
    }

[1m  # azapi_resource.container_apps_job[0m will be updated in-place
[0m  [33m~[0m[0m resource "azapi_resource" "container_apps_job" {
      [33m~[0m[0m body                      = (sensitive value)
        id                        = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.App/jobs/gha-prd-caj001"
        name                      = "gha-prd-caj001"
      [33m~[0m[0m output                    = jsonencode({}) -> (known after apply)
        tags                      = {
            "workload" = "github-runners"
        }
        [90m# (7 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # azapi_resource.key_vault_secret_github_pat[0m will be [1m[31mdestroyed[0m
  # (because azapi_resource.key_vault_secret_github_pat is not in configuration)
[0m  [31m-[0m[0m resource "azapi_resource" "key_vault_secret_github_pat" {
      [31m-[0m[0m body                      = jsonencode(
            {
              [31m-[0m[0m properties = {
                  [31m-[0m[0m attributes  = {
                      [31m-[0m[0m enabled = true
                    }
                  [31m-[0m[0m contentType = "text/plain"
                  [31m-[0m[0m value       = "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"
                }
            }
        ) [90m-> null[0m[0m
      [31m-[0m[0m id                        = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.KeyVault/vaults/gha-prd-kv001/secrets/github-pat" [90m-> null[0m[0m
      [31m-[0m[0m ignore_casing             = false [90m-> null[0m[0m
      [31m-[0m[0m ignore_missing_property   = true [90m-> null[0m[0m
      [31m-[0m[0m location                  = "northeurope" [90m-> null[0m[0m
      [31m-[0m[0m name                      = "github-pat" [90m-> null[0m[0m
      [31m-[0m[0m output                    = jsonencode(
            {
              [31m-[0m[0m properties = {
                  [31m-[0m[0m secretUri = "https://gha-prd-kv001.vault.azure.net/secrets/github-pat"
                }
            }
        ) [90m-> null[0m[0m
      [31m-[0m[0m parent_id                 = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.KeyVault/vaults/gha-prd-kv001" [90m-> null[0m[0m
      [31m-[0m[0m removing_special_chars    = false [90m-> null[0m[0m
      [31m-[0m[0m response_export_values    = [
          [31m-[0m[0m "properties.secretUri",
        ] [90m-> null[0m[0m
      [31m-[0m[0m schema_validation_enabled = true [90m-> null[0m[0m
      [31m-[0m[0m tags                      = {
          [31m-[0m[0m "workload" = "github-runners"
        } [90m-> null[0m[0m
      [31m-[0m[0m type                      = "Microsoft.KeyVault/vaults/secrets@2023-07-01" [90m-> null[0m[0m
    }

[1m  # azurerm_application_insights.application_insights[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_application_insights" "application_insights" {
        id                                    = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.Insights/components/gha-prd-appi001"
        name                                  = "gha-prd-appi001"
        tags                                  = {
            "workload" = "github-runners"
        }
        [90m# (16 unchanged attributes hidden)[0m[0m
    }

[1m  # azurerm_key_vault.key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_key_vault" "key_vault" {
        id                              = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.KeyVault/vaults/gha-prd-kv001"
        name                            = "gha-prd-kv001"
      [33m~[0m[0m public_network_access_enabled   = true [33m->[0m[0m false
        tags                            = {
            "workload" = "github-runners"
        }
        [90m# (12 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m network_acls {
          [33m~[0m[0m default_action             = "Allow" [33m->[0m[0m "Deny"
            [90m# (3 unchanged attributes hidden)[0m[0m
        }
    }

[1m  # azurerm_key_vault_secret.key_vault_secret_github_pat[0m will be created
[0m  [32m+[0m[0m resource "azurerm_key_vault_secret" "key_vault_secret_github_pat" {
      [32m+[0m[0m content_type            = "text/plain"
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m key_vault_id            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.KeyVault/vaults/gha-prd-kv001"
      [32m+[0m[0m name                    = "github-pat"
      [32m+[0m[0m resource_id             = (known after apply)
      [32m+[0m[0m resource_versionless_id = (known after apply)
      [32m+[0m[0m value                   = (sensitive value)
      [32m+[0m[0m version                 = (known after apply)
      [32m+[0m[0m versionless_id          = (known after apply)
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_application_insights[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_application_insights" {
        id                         = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.Insights/components/gha-prd-appi001|logAnalytics"
        name                       = "logAnalytics"
        [90m# (2 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # azurerm_monitor_diagnostic_setting.diagnostic_setting_key_vault[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_monitor_diagnostic_setting" "diagnostic_setting_key_vault" {
        id                             = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/gha-prd-container-rg/providers/Microsoft.KeyVault/vaults/gha-prd-kv001|logAnalytics"
        name                           = "logAnalytics"
        [90m# (3 unchanged attributes hidden)[0m[0m

      [31m-[0m[0m metric {
          [31m-[0m[0m category = "AllMetrics" [90m-> null[0m[0m
          [31m-[0m[0m enabled  = true [90m-> null[0m[0m

          [31m-[0m[0m retention_policy {
              [31m-[0m[0m days    = 0 [90m-> null[0m[0m
              [31m-[0m[0m enabled = false [90m-> null[0m[0m
            }
        }

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 5 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>